Model: "unet_depth5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 16384, 1)]   0                                            
__________________________________________________________________________________________________
encode0 (Sequential)            (None, 16384, 6)     186         input_6[0][0]                    
__________________________________________________________________________________________________
mp_encode0 (MaxPooling1D)       (None, 4096, 6)      0           encode0[0][0]                    
__________________________________________________________________________________________________
encode1 (Sequential)            (None, 4096, 12)     768         mp_encode0[0][0]                 
__________________________________________________________________________________________________
mp_encode1 (MaxPooling1D)       (None, 1024, 12)     0           encode1[0][0]                    
__________________________________________________________________________________________________
encode2 (Sequential)            (None, 1024, 24)     2832        mp_encode1[0][0]                 
__________________________________________________________________________________________________
mp_encode2 (MaxPooling1D)       (None, 256, 24)      0           encode2[0][0]                    
__________________________________________________________________________________________________
encode3 (Sequential)            (None, 256, 48)      10848       mp_encode2[0][0]                 
__________________________________________________________________________________________________
mp_encode3 (MaxPooling1D)       (None, 64, 48)       0           encode3[0][0]                    
__________________________________________________________________________________________________
encode4 (Sequential)            (None, 64, 96)       42432       mp_encode3[0][0]                 
__________________________________________________________________________________________________
mp_encode4 (MaxPooling1D)       (None, 16, 96)       0           encode4[0][0]                    
__________________________________________________________________________________________________
two_conv_center (Sequential)    (None, 16, 192)      167808      mp_encode4[0][0]                 
__________________________________________________________________________________________________
conv_transpose_decoder4 (Sequen (None, 64, 192)      148416      two_conv_center[0][0]            
__________________________________________________________________________________________________
decoder4 (Concatenate)          (None, 64, 288)      0           encode4[0][0]                    
                                                                 conv_transpose_decoder4[0][0]    
__________________________________________________________________________________________________
two_conv_decoder4 (Sequential)  (None, 64, 192)      278400      decoder4[0][0]                   
__________________________________________________________________________________________________
conv_transpose_decoder3 (Sequen (None, 256, 96)      74208       two_conv_decoder4[0][0]          
__________________________________________________________________________________________________
decoder3 (Concatenate)          (None, 256, 144)     0           encode3[0][0]                    
                                                                 conv_transpose_decoder3[0][0]    
__________________________________________________________________________________________________
two_conv_decoder3 (Sequential)  (None, 256, 96)      70080       decoder3[0][0]                   
__________________________________________________________________________________________________
conv_transpose_decoder2 (Sequen (None, 1024, 48)     18672       two_conv_decoder3[0][0]          
__________________________________________________________________________________________________
decoder2 (Concatenate)          (None, 1024, 72)     0           encode2[0][0]                    
                                                                 conv_transpose_decoder2[0][0]    
__________________________________________________________________________________________________
two_conv_decoder2 (Sequential)  (None, 1024, 48)     17760       decoder2[0][0]                   
__________________________________________________________________________________________________
conv_transpose_decoder1 (Sequen (None, 4096, 24)     4728        two_conv_decoder2[0][0]          
__________________________________________________________________________________________________
decoder1 (Concatenate)          (None, 4096, 36)     0           encode1[0][0]                    
                                                                 conv_transpose_decoder1[0][0]    
__________________________________________________________________________________________________
two_conv_decoder1 (Sequential)  (None, 4096, 24)     4560        decoder1[0][0]                   
__________________________________________________________________________________________________
conv_transpose_decoder0 (Sequen (None, 16384, 12)    1212        two_conv_decoder1[0][0]          
__________________________________________________________________________________________________
decoder0 (Concatenate)          (None, 16384, 18)    0           encode0[0][0]                    
                                                                 conv_transpose_decoder0[0][0]    
__________________________________________________________________________________________________
two_conv_decoder0 (Sequential)  (None, 16384, 12)    1200        decoder0[0][0]                   
__________________________________________________________________________________________________
conv1d_89 (Conv1D)              (None, 16384, 1)     13          two_conv_decoder0[0][0]          
==================================================================================================
Total params: 844,123
Trainable params: 840,379
Non-trainable params: 3,744
__________________________________________________________________________________________________